{
    "mathematics": "My passion for mathematics began at an early age, when I participated in numerous mathematics competitions and olympiads with success. Combination of this and interest in technology was what pushed me to pursue a degree in computer science where I sought real life application of my passion. I was not disappointed, mathematics is pretty much everywhere in computer science, and I continuously enjoy seeing how it all connects through the work that I do. Currently, I’m also channelling my passion for mathematics into tutoring, trying to induce the same passion in my students.",
    "education": "I grew up in a family of educators, which has inspired me to pursue career in academia. I am currently working as a high school mathematics tutor. Moreover, I recently started working as a Teacher Assistant at TU Delft. This has allowed me to develop important skills in explaining complex concepts, guiding students, and supervising their learning process. I am looking to improve my didactic skills and, in the future, I aspire to become a professional educator, helping shape the next generation of learners and researchers.",
    "languageacquisition1": "My interest in languages ​​was born around the 6th grade of primary school when during the holidays, I decided to learn English intensively on my own, in primary school I could not count on good preparation. I had to motivate myself enough to pass the admission test to get into my dream international school and I succeeded. I have always seen languages ​​as more than just a tool for communication. Both in Polish and other languages, I was really interested in grammar and language theory in general. As a result, I currently also speak English, Dutch, Italian and a little Spanish.",
    "languageacquisition2": "Speaking of languages, I must also mention programming languages. This is another passion of mine, although maybe they're the same thing? When programming in Java and Python, I am just as interested in the syntax and theory of the language as in the previous case. Mathematics is another language I admire. I have always been inspired by how mathematics is a universal language and leads to the discovery of one truth. Since I was a child, I have always been surrounded by music. I sang at local competitions, later I graduated from music school and played in a brass band. Music can also be seen as a language, it has its own grammar and people who understand it."
  }